Git называют системой контроля версий
https://git-scm.com/download/

apt-get update && apt-get install git

GitBash — программа-интерпретатор, запускающую Git из командной строки Windows

Untracked files — то есть неотслеживаемые файлы
 
 
#-------------. 1 Идентификация

git config --global user.name "Stas Basov" 
# вводите своё имя или ник латиницей и в кавычках

git config --global user.email stasbasov@yandex.ru
# здесь нужно ввести свой реальный e-mail

$ git config --global user.name 'Timur Gabdrakhmanov'
$ git config --global user.email timbest@bk.ru


#-------------. 2 Проверка введенных настроек
$ git config --list

...
init.defaultbranch=master
user.name=Timur Gabdrakhmanov
user.email=timbest@bk.ru
color.ui=true


#-------------. 3 Инициализировать папку с Git - репозиторием
git init

Initialized empty Git repository in C:/data/git/.git/

mkdir   - создать директорию
cd 		- перемещение м/у директориями


Если перейти в каталог с проектом и выполнить команду git init, Git начнёт отслеживать файлы в выбранной директории.


#-------------. 4 Подготовить все файлы к сохранению
git add data.csv script.py
git add --all
git add -A



#-------------. 5 Сохранение версии файлов в Git называют «коммитом».
Сделать коммит (совершать, бросить в бой) — значит сохранить текущее состояние файлов. 



#-------------. 6 




#-------------. 7




#-------------. 8




#-------------. 9




#-------------. 10




#-------------. 11




#-------------. 12




#-------------. 13




#-------------. 14




#-------------. 15




#-------------. 16




#-------------. 17




#-------------. 18




#-------------. 19




#-------------. 20




#-------------. 21




#-------------. 22




#-------------. 23




#-------------. 24




#-------------. 25




#-------------. 26




#-------------. 27




#-------------. 28




#-------------. 29




#-------------. 30




#-------------. 31




#-------------. 32




#-------------. 33




#-------------. 34




#-------------. 35




#-------------. 36




#-------------. 37




#-------------. 38




#-------------. 39




#-------------. 40




#-------------. 41




#-------------. 42




#-------------. 43




#-------------. 44




#-------------. 45




#-------------. 46




#-------------. 47




#-------------. 48




#-------------. 49

